AlfredKrutina/chess_esp32_c6_devkit/sdkconfig.defaults
# ESP32-C6 Chess v2.4 — výchozí Kconfig pro nový build / clone.
# Sladit s `sdkconfig`: při změně defaults často `idf.py fullclean reconfigure build`.
# Klíče zde přepisují tovární výchozí IDF; samotný `sdkconfig` drží plný strom z menuconfig.
CONFIG_IDF_TARGET="esp32c6"

# CzechMate — automatizovaný test task (vypni pro úsporu ~4,5 KiB stack + TCB)
# CONFIG_CHESS_ENABLE_TEST_TASK is not set

# HTTP web server — vypni pro BLE-only / menší firmware (bez REST, WS, PNG embedů):
CONFIG_CHESS_ENABLE_WEB_SERVER=y

# Gameplay safety profile (FULL — production defaults)
CONFIG_CHESS_GAMEPLAY_PROFILE_FULL=y
CONFIG_CHESS_MG_ENABLE=y
CONFIG_CHESS_MG_FREEZE_MOVES=y
CONFIG_CHESS_MG_AUTO_CLEAR=y
CONFIG_CHESS_MG_NVS_RESYNC=y
CONFIG_CHESS_MG_LED_ENABLE=y
CONFIG_CHESS_MG_LED_WHITE_YELLOW=y
CONFIG_CHESS_MG_LED_BLACK_BLUE=y
CONFIG_CHESS_MG_LED_GHOST_ORANGE=y
CONFIG_CHESS_MG_LED_MISSING_WHITE=y
CONFIG_CHESS_ER_ENABLE=y
CONFIG_CHESS_ER_LOCK_GAME=y
CONFIG_CHESS_ER_MUTATE_BOARD=y
CONFIG_CHESS_ER_LED_RED_PERSIST=y
CONFIG_CHESS_ER_LED_RED_BLINK=y
CONFIG_CHESS_ER_LED_VALID_BLUE=y
CONFIG_CHESS_MH_ENABLE=y
CONFIG_CHESS_MH_LEGAL_MOVES_BLUE=y
CONFIG_CHESS_MH_CASTLING_BLUE=y
CONFIG_CHESS_MH_PROMOTION_BLUE=y
CONFIG_CHESS_MH_MOVABLE_YELLOW=y
CONFIG_CHESS_DIAG_UART_ERROR_DETAIL=y

# HTTP server — WebSocket /ws (watchOS/iOS); bez toho klient dostane „bad response“ (-1011)
CONFIG_HTTPD_WS_SUPPORT=y

# System
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3

# USB Serial JTAG Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_NONE is not set

# JTAG Configuration (keep GPIO0-5 free for debugging)
CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME=n

# Watchdog Configuration
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# NVS Configuration
CONFIG_NVS_ENCRYPTION=n

# Security Configuration
CONFIG_SECURE_BOOT_V2_ENABLED=n

# WiFi — nutné pro web_server (AP/STA), HTTP, WebSocket, mDNS. Bez toho aplikace přes LAN nefunguje.
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# Bluetooth — NimBLE GATT (CZECHMATE). Po změně spusť `idf.py fullclean reconfigure build`.
# Pokud sdkconfig přepisuje defaults, zapni BT v menuconfig Component config → Bluetooth.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Větší MSYS pool — při AP/STA + HTTP může default nestačit na ATT; pomáhá proti „0 služeb“ na iOS.
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=32
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=32
# Host task: default 4096 nestačí — GATT read snapshotu volá build_snapshot (clock_json ~1 KiB na stacku)
# + NimBLE/HS + coexistence → Guru Meditation „Stack protection fault“ v nimble_host (viz log).
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
# Bonding klíče do NVS — po restartu desky zůstane párování (iOS/Android); vyžaduje ble_store_config_init().
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# INFO loguje každý GATT notify (snapshot chunky) — zaplaví sériovku; WARNING stačí na chyby/varování.
# CONFIG_BT_NIMBLE_LOG_LEVEL_INFO is not set
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# WiFi + BLE na jednom čipu (nutné pro stabilní provoz obojího).
CONFIG_ESP_COEX_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Debug Configuration
CONFIG_ESP_DEBUG_STUBS_ENABLE=y
CONFIG_ESP_DEBUG_OCDAWARE=y

# Component Configuration
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y

# Build Configuration — výchozí 16 MB flash + partitions.csv (dual OTA + stm32_fw).
# Modul se skutečně 4 MB flash → přepni na CONFIG_ESPTOOLPY_FLASHSIZE_4MB a
# partitions_4mb_factory_only.csv nebo partitions_4mb_dual_ota.csv (jen malý build).
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# Partition Table Configuration
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback — nový image musí potvrdit esp_ota_mark_app_valid_cancel_rollback() v main.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_ROLLBACK_ENABLE=y

# --- Matrix vstup (build-time choice) ---
# Reed: matrix_scan_all() dělá GPIO multiplex 8×8 (viz matrix_task.c + MATRIX_* v freertos_chess.h).
# Hall: hall_i2c_matrix_fill_state() čte 4× STM přes I2C (hall_i2c_spec.h).
#
# Návrat k „STM flash přes I2C při běhu“:
# - idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.hall_v2" build flash
# - menuconfig: CHESS_MATRIX_INPUT_I2C_HALL + CHESS_STM32_I2C_BL_ENABLE (+ často CHESS_STM32_BL_SHARE_I2C_HALL=y).
# - Zapojení: docs/reference/ZAPOJENI_ESP_STM4.md
CONFIG_CHESS_MATRIX_INPUT_GPIO_REED=y
# CONFIG_CHESS_MATRIX_INPUT_I2C_HALL is not set

# STM32 ROM bootloader (AN4221) — vypnuto v reed profilu kvůli kolizi pinů výše.
# CONFIG_CHESS_STM32_I2C_BL_ENABLE is not set
